# Данные из предоставленных материалов
MATERIALS = {
    "children": {
        "title": "👶 Памятка для детей",
        "content": "Общая информация о безопасности для детей",
        "subtopics": {
            "mes": {
                "title": "Звонки из МЭШ",
                "content": """
• При звонках «разработчиков» или директора школы не называйте личных данных (пароли, логины, SMS-коды) и бросайте трубку.
• Сообщите родителям.
"""
            },
            "win": {
                "title": "Выигрыш",
                "content": """
• Не переводите деньги для оплаты различных сборов для получения приза.
• Не вводите личные данные.
• Проверяйте источники лотереи.
"""
            },
            "easy-money": {
                "title": "Легкий заработок",
                "content": """
• Не предоставляйте личные данные.
• Не переводите деньги.
• Потребуйте заключить трудовой или гражданско-правовой договор.
"""
            },
            "friend-help": {
                "title": "Просят о помощи от имени друга",
                "content": """
• Если друг пишет странные сообщения, то лучше позвоните ему или встретьтесь лично.
• Напишите ему в другой соц.сети и уточните информацию.
• Не переводите деньги и не переходите по ссылкам.
"""
            },
            "pushkin-card": {
                "title": "Вывод денег с Пушкинской карты",
                "content": "• Вывод денег с карты незаконен."
            },
            "fake-stores": {
                "title": "Фейковые онлайн магазины",
                "content": """
• Не переходите по ссылкам из электронных писем.
• Проверяйте отзывы.
• Совершайте покупки на проверенных сайтах.
"""
            },
            "oge-ege": {
                "title": "Помощь в сдаче ОГЭ и ЕГЭ",
                "content": """
• Не переходите по платным ссылкам и не отправляйте деньги.
• Готовьтесь к экзаменам на проверенных сайтах и ресурсах.
"""
            },
            "fake-friends": {
                "title": "Фейковые друзья в соц.сетях",
                "content": """
• Сделайте аккаунт в соц.сетях частным и не добавляйте непроверенных лиц в друзья.
• Не размещайте информацию личного плана, которой могут воспользоваться мошенники.
"""
            },
            "card-purchase": {
                "title": "Покупка карт мошенниками",
                "content": "• Если предлагают купить Вашу карту, откажитесь (эта карта будет участвовать в мошеннических схемах, за которые влечет уголовная ответственность)."
            }
        }
    },
    "adults": {
        "title": "👨‍💼 Памятка для взрослых",
        "content": "Общая информация о безопасности для взрослых",
        "subtopics": {
            "bank": {
                "title": "Звонок из банка",
                "content": """
• Не называйте конфиденциальную информацию (кодовое слово, пароль, SMS-пароль)
• Перезвоните на официальный номер банка и уточните информацию.
"""
            },
            "law-enforcement": {
                "title": "Звонок из правоохранительных органов",
                "content": """
• Перезвоните на официальный телефон отделения.
• Не сообщайте финансовую информацию (номер карты, реквизиты и тд)
"""
            },
            "relatives-incident": {
                "title": "Происшествие с родственниками",
                "content": """
• Позвоните родственнику (можно по видеосвязи) и уточните информацию.
• Задайте вопрос ответ на который знает только родственник.
"""
            },
            "friend-help": {
                "title": "Просят о помощи от имени друга",
                "content": """
• Если друг пишет странные сообщения, то лучше позвони ему или встретьтесь лично.
• Напишите ему в другой соц.сети и уточните информацию.
• Не переводите деньги и не переходите по ссылкам.
"""
            },
            "fake-stores": {
                "title": "Фейковые онлайн магазины",
                "content": """
• Не переходите по ссылкам из электронных писем.
• Проверяйте отзывы.
• Совершайте покупки на проверенных сайтах.
"""
            },
            "boss": {
                "title": "Звонок от начальника",
                "content": """
• Перезвоните ему по известному номеру.
• Задайте вопрос ответ на который знает только начальник.
• Не сообщайте личные данные.
"""
            },
            "surveys": {
                "title": "Опросы и конкурсы",
                "content": """
• Не сообщайте личную информацию.
• Свяжитесь с отправителем и уточнить информацию.
"""
            },
            "charity": {
                "title": "Сбор денег на благотворительность",
                "content": """
• Используйте проверенные платформы.
• Не перечисляйте деньги на личные карты «волонтерам».
"""
            },
            "damage": {
                "title": "Снятие порчи или гадание",
                "content": """
• Запишите разговор и обратитесь в полицию.
• Не верьте в это.
"""
            }
        }
    },
    "pensioners": {
        "title": "👵 Памятка для пенсионеров",
        "content": "Общая информация о безопасности для пенсионеров",
        "subtopics": {
            "bank": {
                "title": "Звонок из банка",
                "content": """
• Не называйте конфиденциальную информацию (кодовое слово, пароль, SMS-пароль, номер карты и тд).
• Перезвоните на официальный номер банка и уточните информацию.
• Сообщите родственникам.
"""
            },
            "law-enforcement": {
                "title": "Звонок из правоохранительных органов",
                "content": """
• Перезвоните на официальный телефон отделения.
• Не сообщайте финансовую информацию (номер карты, реквизиты и тд)
• Сообщите родственникам.
"""
            },
            "relatives-incident": {
                "title": "Происшествие с родственниками",
                "content": """
• Позвоните родственнику (можно по видеосвязи) и уточните информацию.
• Задайте вопрос ответ на который знает только родственник.
"""
            },
            "pension": {
                "title": "Прибавка к пенсии или налоговые сборы",
                "content": """
• Прекратите разговор (гражданам не звонят для пересчета пенсии).
• Позвоните в Соцфонд по официальному телефону или сходите в МФЦ.
"""
            },
            "housing-utility": {
                "title": "ЖКХ",
                "content": """
• Проверяйте платежную информацию в квитанции с помощью официальных ресурсов.
• Не называйте никому коды SMS из «Госуслуги».
• Не переходите по неизвестным ссылкам.
"""
            },
            "medical-examination": {
                "title": "Бесплатное мед.обследование и лекарства",
                "content": """
• Свяжитесь с родственниками.
• Не переходите по неизвестным ссылкам и не называйте SMS-коды
• Прекратите разговор.
"""
            }
        }
    }
}

# Ключевые слова для поиска
KEYWORDS = {
    "мэш": {"category": "children", "subtopic": "mes"},
    "выигрыш": {"category": "children", "subtopic": "win"},
    "заработок": {"category": "children", "subtopic": "easy-money"},
    "пушкинская карта": {"category": "children", "subtopic": "pushkin-card"},
    "банк": {"category": "adults", "subtopic": "bank"},
    "правоохранительные органы": {"category": "adults", "subtopic": "law-enforcement"},
    "родственники": {"category": "adults", "subtopic": "relatives-incident"},
    "друг": {"category": "adults", "subtopic": "friend-help"},
    "пенсия": {"category": "pensioners", "subtopic": "pension"},
    "налоговые сборы": {"category": "pensioners", "subtopic": "pension"},
    "жкх": {"category": "pensioners", "subtopic": "housing-utility"},
    "медобследование": {"category": "pensioners", "subtopic": "medical-examination"},
    "фейковые магазины": {"category": "children", "subtopic": "fake-stores"},
    "огэ": {"category": "children", "subtopic": "oge-ege"},
    "егэ": {"category": "children", "subtopic": "oge-ege"},
    "фейковые друзья": {"category": "children", "subtopic": "fake-friends"},
    "начальник": {"category": "adults", "subtopic": "boss"},
    "опросы": {"category": "adults", "subtopic": "surveys"},
    "конкурсы": {"category": "adults", "subtopic": "surveys"},
    "благотворительность": {"category": "adults", "subtopic": "charity"},
    "порча": {"category": "adults", "subtopic": "damage"},
    "гадание": {"category": "adults", "subtopic": "damage"}
}